# Используйте базовый образ Python
FROM python:3.10

# Установите рабочую директорию в контейнере
WORKDIR /app

# Скопируйте зависимости проекта в контейнер
COPY requirements.txt .

# Установите зависимости проекта
RUN pip install --no-cache-dir -r requirements.txt

# Скопируйте все файлы проекта в контейнер
COPY . .

# Определите порт, на котором будет работать ваше приложение
EXPOSE 8000

# Запустите ваше приложение при старте контейнера
CMD ["uvicorn", "webapp.main:app", "--host", "0.0.0.0", "--port", "8000"]